implementation-details.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-04 Sun 10:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Starting up clasp</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/><link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/></head>
<body>
<div id="preamble" class="status">
<div id="top-menu">
<ul>
<li><a href="index.html">Clasp</a>
<ul>
<li><a href="news.html">News</a></li>
<li><a href="features.html">Features</a></li>
<li><a href="download.html">Download</a></li>
</ul></li>
<li><a href="index.html">Doc</a>
<ul>
<li><a href="license.html">License</a></li>
<li><a href="building.html">Building Clasp</a></li>
<li><a href="clbind-doc.html">Exposing C++ Libraries</a></li>
</ul></li>
<li><a href="index.html">Misc</a>
<ul>
<li><a href="community.html">Community</a></li>
<li><a href="projects.html">Projects</a></li>
<li><a href="media.html">Media</a></li>
<li><a href="acknowlegements.html">Acknowledgements</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="content">
<h1 class="title">Starting up clasp</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org459cc72">1. Clasp Startup</a>
<ul>
<li><a href="#org657620b">1.1. Command Line Options That Control Startup</a></li>
</ul>
</li>
<li><a href="#org4c56878">2. Executables with embedded snapshots</a></li>
<li><a href="#orgdd3b2fc">3. Fasp files</a></li>
</ul>
</div>
</div>

<div id="outline-container-org459cc72" class="outline-2">
<h2 id="org459cc72"><span class="section-number-2">1</span> Clasp Startup</h2>
<div class="outline-text-2" id="text-1">
<p>
Clasp has a variety of ways that it can startup.
</p>

<ol class="org-ol">
<li>Clasp can startup from a "snapshot" - this is the fastest startup. 
<ul class="org-ul">
<li>Snapshots are recordings of memory that were created using a running Clasp. <code>(gctools:save-lisp-and-die)</code> creates a snapshot within a running Clasp that is written into "app-fasl:&lt;executable-name&gt;.snapshot".</li>
</ul></li>

<li>Clasp can startup from a snapshot embedded within the executable.</li>

<li>Clasp can startup from an "image" - this is a fasl file that contains compiled Common Lisp code. 
<ul class="org-ul">
<li>Clasp replays all of the top level forms when it loads an image. This startup can take anywhere from a few seconds to tens of seconds for cando or other extensions that use lots of quicklisp systems.</li>
</ul></li>
</ol>
</div>


<div id="outline-container-org657620b" class="outline-3">
<h3 id="org657620b"><span class="section-number-3">1.1</span> Command Line Options That Control Startup</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>-T/&#x2013;type (default|snapshot|image)</li>
<li>-i/&#x2013;image &lt;filename&gt;</li>
<li>-I/&#x2013;ignore-image</li>
<li>-n/&#x2013;noinit</li>
</ul>

<p>
<code>-T default</code> (the default) means first attempt to load the default snapshot file and if its not found then proceed 
   to the default image file and if that is not found then terminate with an error.
</p>

<p>
<code>-T snapshot</code> means load the default snapshot file and if not found then terminate with an error. The default
snapshot file is (in the Common Lisp logical pathname notation) "app-fasl:&lt;executable-name&gt;.snapshot".
</p>

<p>
<code>-T image</code> means load the default image file and if that is not found then terminate with an error. The default image file is (in the Common Lisp logical pathname notation) "app-fasl:&lt;executable-name&gt;.&lt;fasl-extension&gt;". The &lt;fasl-extension&gt; changes depending on how clasp is built.
</p>

<p>
<code>-i &lt;filename&gt;</code> means if the filename ends in ".snapshot" then load it as a snapshot file. If &lt;filename&gt; does not end in ".snapshot" then load it as an image - otherwise signal an error. The -T and -i options are mutually exclusive. The -i option will override the -T option.
</p>

<p>
<code>-I</code> means don't load snapshot or image files. Instead proceed to load the kernel/init.lsp file.
</p>

<p>
<code>-n</code> Used with -I. If this is passed then don't load the init.lsp file. This will start a very bare bones REPL and load no Common Lisp code.
</p>

<p>
Examples:
</p>
<dl class="org-dl">
<dt><code>clasp</code></dt><dd>Will try to load "app-fasl:clasp.snapshot" and then "app-fasl:clasp.&lt;fasl&gt;" and if it doesn't find that - it will terminate with an error.</dd>
<dt><code>clasp -T image</code></dt><dd>Will try to load "app-fasl:clasp.&lt;fasl&gt;" and if it isn't found - clasp will terminate with an error.</dd>
<dt><code>clasp -I -n</code></dt><dd>Will start a primitive clasp REPL without loading any snapshot, image, or Common Lisp source code. It will start the pidgin Common Lisp interpreter.</dd>
<dt><code>clasp -I</code></dt><dd>Will load the "sys:kernel;init.lsp" source file and start the pidgin Common Lisp interpreter.</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org4c56878" class="outline-2">
<h2 id="org4c56878"><span class="section-number-2">2</span> Executables with embedded snapshots</h2>
<div class="outline-text-2" id="text-2">
<p>
Executables with embedded snapshots always use those snapshots.
</p>
</div>
</div>

<div id="outline-container-orgdd3b2fc" class="outline-2">
<h2 id="orgdd3b2fc"><span class="section-number-2">3</span> Fasp files</h2>
<div class="outline-text-2" id="text-3">
<p>
See <a href="fasp.html">Fasp files are concatenated object files.</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<center><p>
<a href="sitemap.html">Sitemap</a> &#x2014; <a href="license.html">License</a>
</p>
</center>
</div>
</body>
</html>
